skocharyan/Mux/code/STM32F415_master_ST_ert_rtw/STM32F415_master_ST.c
/*
 * File: STM32F415_master_ST.c
 *
 * Code generated for Simulink model 'STM32F415_master_ST'.
 *
 * Model version                  : 1.146
 * Simulink Coder version         : 23.2 (R2023b) 01-Aug-2023
 * C/C++ source code generated on : Mon Jul  8 23:31:52 2024
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: ARM Compatible->ARM Cortex
 * Code generation objectives:
 *    1. RAM efficiency
 *    2. Execution efficiency
 *    3. Safety precaution
 *    4. Traceability
 * Validation result: Not run
 */

#include "STM32F415_master_ST.h"
#include "STM32F415_master_ST_types.h"
#include <string.h>
#include "rtwtypes.h"
#include "stm_timer_ll.h"
#include "STM32F415_master_ST_private.h"

/* Block signals (default storage) */
B_STM32F415_master_ST_T STM32F415_master_ST_B;

/* Block states (default storage) */
DW_STM32F415_master_ST_T STM32F415_master_ST_DW;

/* data stores shared across model instances */
SharedDSM_STM32F415_master_ST_T STM32F415_master_ST_SharedDSM;/* '<Root>/Data Store Memory1' */

/* Real-time model */
static RT_MODEL_STM32F415_master_ST_T STM32F415_master_ST_M_;
RT_MODEL_STM32F415_master_ST_T *const STM32F415_master_ST_M =
  &STM32F415_master_ST_M_;

/* Forward declaration for local functions */
static void STM32F415_SystemCore_setup_poof(stm32cube_blocks_UARTWrite_ST_T *obj);
static void STM32F415_ma_SystemCore_setup_p(stm32cube_blocks_UARTWrite_ST_T *obj);
static void STM32F415_m_SystemCore_setup_po(stm32cube_blocks_UARTWrite_ST_T *obj);
static void STM32F415__SystemCore_setup_poo(stm32cube_blocks_UARTWrite_ST_T *obj);
static void STM32_SystemCore_setup_poofajod(stm32cube_blocks_UARTRead_STM_T *obj);
static void STM32F41_SystemCore_setup_poofa(stm32cube_blocks_UARTRead_S_p_T *obj);
static void STM32F415_mast_SystemCore_setup(stm32cube_blocks_UARTRead_STM_T *obj);
static void STM32F_SystemCore_setup_poofajo(stm32cube_blocks_TimerBlock_S_T *obj);
static void rate_monotonic_scheduler(void);

/*
 * Set which subrates need to run this base step (base rate always runs).
 * This function must be called prior to calling the model step function
 * in order to remember which rates need to run this base step.  The
 * buffering of events allows for overlapping preemption.
 */
void STM32F415_master_ST_SetEventsForThisBaseStep(boolean_T *eventFlags)
{
  /* Task runs when its counter is zero, computed via rtmStepTask macro */
  eventFlags[1] = ((boolean_T)rtmStepTask(STM32F415_master_ST_M, 1));
  eventFlags[2] = ((boolean_T)rtmStepTask(STM32F415_master_ST_M, 2));
  eventFlags[3] = ((boolean_T)rtmStepTask(STM32F415_master_ST_M, 3));
  eventFlags[4] = ((boolean_T)rtmStepTask(STM32F415_master_ST_M, 4));
}

/*
 *         This function updates active task flag for each subrate
 *         and rate transition flags for tasks that exchange data.
 *         The function assumes rate-monotonic multitasking scheduler.
 *         The function must be called at model base rate so that
 *         the generated code self-manages all its subrates and rate
 *         transition flags.
 */
static void rate_monotonic_scheduler(void)
{
  /* Compute which subrates run during the next base time step.  Subrates
   * are an integer multiple of the base rate counter.  Therefore, the subtask
   * counter is reset when it reaches its limit (zero means run).
   */
  (STM32F415_master_ST_M->Timing.TaskCounters.TID[1])++;
  if ((STM32F415_master_ST_M->Timing.TaskCounters.TID[1]) > 1) {/* Sample time: [0.00025s, 0.0s] */
    STM32F415_master_ST_M->Timing.TaskCounters.TID[1] = 0;
  }

  (STM32F415_master_ST_M->Timing.TaskCounters.TID[2])++;
  if ((STM32F415_master_ST_M->Timing.TaskCounters.TID[2]) > 2) {/* Sample time: [0.000375s, 0.0s] */
    STM32F415_master_ST_M->Timing.TaskCounters.TID[2] = 0;
  }

  (STM32F415_master_ST_M->Timing.TaskCounters.TID[3])++;
  if ((STM32F415_master_ST_M->Timing.TaskCounters.TID[3]) > 11) {/* Sample time: [0.0015s, 0.0s] */
    STM32F415_master_ST_M->Timing.TaskCounters.TID[3] = 0;
  }

  (STM32F415_master_ST_M->Timing.TaskCounters.TID[4])++;
  if ((STM32F415_master_ST_M->Timing.TaskCounters.TID[4]) > 79) {/* Sample time: [0.01s, 0.0s] */
    STM32F415_master_ST_M->Timing.TaskCounters.TID[4] = 0;
  }
}

static void STM32F415_SystemCore_setup_poof(stm32cube_blocks_UARTWrite_ST_T *obj)
{
  UART_Type_T b;
  obj->isSetupComplete = false;

  /* Start for MATLABSystem: '<S23>/UART//USART Write' incorporates:
   *  MATLABSystem: '<S25>/UART//USART Write'
   */
  obj->isInitialized = 1;
  b.buffer.txBufferPtr = (void*)(&obj->UARTInternalBuffer[0]);
  b.enableRxOrTx = 2U;
  b.mode = UART_TX_INTERRUPT_MODE;
  b.peripheralPtr = USART2;
  b.txdmaPeripheralPtr = NULL;
  b.txdmastream = 0;
  b.buffer.txBufferSize = 128U;
  obj->UARTHandle = MW_UART_Initialize(&b);
  obj->isSetupComplete = true;
}

static void STM32F415_ma_SystemCore_setup_p(stm32cube_blocks_UARTWrite_ST_T *obj)
{
  UART_Type_T b;
  obj->isSetupComplete = false;

  /* Start for MATLABSystem: '<S13>/UART//USART Write' */
  obj->isInitialized = 1;
  b.buffer.txBufferPtr = (void*)(&obj->UARTInternalBuffer[0]);
  b.enableRxOrTx = 2U;
  b.mode = UART_TX_INTERRUPT_MODE;
  b.peripheralPtr = UART4;
  b.txdmaPeripheralPtr = NULL;
  b.txdmastream = 0;
  b.buffer.txBufferSize = 128U;
  obj->UARTHandle = MW_UART_Initialize(&b);
  obj->isSetupComplete = true;
}

static void STM32F415_m_SystemCore_setup_po(stm32cube_blocks_UARTWrite_ST_T *obj)
{
  UART_Type_T b;
  obj->isSetupComplete = false;

  /* Start for MATLABSystem: '<S16>/UART//USART Write' */
  obj->isInitialized = 1;
  b.buffer.txBufferPtr = (void*)(&obj->UARTInternalBuffer[0]);
  b.enableRxOrTx = 2U;
  b.mode = UART_TX_INTERRUPT_MODE;
  b.peripheralPtr = USART6;
  b.txdmaPeripheralPtr = NULL;
  b.txdmastream = 0;
  b.buffer.txBufferSize = 128U;
  obj->UARTHandle = MW_UART_Initialize(&b);
  obj->isSetupComplete = true;
}

static void STM32F415__SystemCore_setup_poo(stm32cube_blocks_UARTWrite_ST_T *obj)
{
  UART_Type_T b;
  obj->isSetupComplete = false;

  /* Start for MATLABSystem: '<S5>/UART//USART Write' */
  obj->isInitialized = 1;
  b.buffer.txBufferPtr = (void*)(&obj->UARTInternalBuffer[0]);
  b.enableRxOrTx = 2U;
  b.mode = UART_TX_INTERRUPT_MODE;
  b.peripheralPtr = UART5;
  b.txdmaPeripheralPtr = NULL;
  b.txdmastream = 0;
  b.buffer.txBufferSize = 128U;
  obj->UARTHandle = MW_UART_Initialize(&b);
  obj->isSetupComplete = true;
}

static void STM32_SystemCore_setup_poofajod(stm32cube_blocks_UARTRead_STM_T *obj)
{
  UART_Type_T b;
  obj->isSetupComplete = false;

  /* Start for MATLABSystem: '<Root>/UART//USART Read6' */
  obj->isInitialized = 1;
  b.buffer.rxBufferPtr = (void*)(&obj->UARTInternalBuffer[0]);
  b.enableRxOrTx = 1.0;

  /* Start for MATLABSystem: '<Root>/UART//USART Read6' */
  b.mode = UART_RX_INTERRUPT_MODE;
  b.peripheralPtr = USART2;
  b.rxdmaPeripheralPtr = NULL;
  b.rxdmastream = 0;
  b.disableDMAIntOnError = false;

  /* Start for MATLABSystem: '<Root>/UART//USART Read6' */
  b.buffer.rxBufferSize = 128U;
  obj->UARTHandle = MW_UART_Initialize(&b);
  obj->isSetupComplete = true;
}

static void STM32F41_SystemCore_setup_poofa(stm32cube_blocks_UARTRead_S_p_T *obj)
{
  UART_Type_T b;
  obj->isSetupComplete = false;

  /* Start for MATLABSystem: '<Root>/MAV Receiver' */
  obj->isInitialized = 1;
  b.buffer.rxBufferPtr = (void*)(&obj->UARTInternalBuffer[0]);
  b.enableRxOrTx = 1.0;

  /* Start for MATLABSystem: '<Root>/MAV Receiver' */
  b.mode = UART_RX_INTERRUPT_MODE;
  b.peripheralPtr = UART4;
  b.rxdmaPeripheralPtr = NULL;
  b.rxdmastream = 0;
  b.disableDMAIntOnError = false;

  /* Start for MATLABSystem: '<Root>/MAV Receiver' */
  b.buffer.rxBufferSize = 304U;
  obj->UARTHandle = MW_UART_Initialize(&b);
  obj->isSetupComplete = true;
}

