skocharyan/Mux/code/STM32F415_master_ST_ert_rtw/STM32F415_master_ST.c
static void STM32F415_mast_SystemCore_setup(stm32cube_blocks_UARTRead_STM_T *obj)
{
  UART_Type_T b;
  obj->isSetupComplete = false;

  /* Start for MATLABSystem: '<Root>/AT Receiver' */
  obj->isInitialized = 1;
  b.buffer.rxBufferPtr = (void*)(&obj->UARTInternalBuffer[0]);
  b.enableRxOrTx = 1.0;

  /* Start for MATLABSystem: '<Root>/AT Receiver' */
  b.mode = UART_RX_INTERRUPT_MODE;
  b.peripheralPtr = USART6;
  b.rxdmaPeripheralPtr = NULL;
  b.rxdmastream = 0;
  b.disableDMAIntOnError = false;

  /* Start for MATLABSystem: '<Root>/AT Receiver' */
  b.buffer.rxBufferSize = 128U;
  obj->UARTHandle = MW_UART_Initialize(&b);
  obj->isSetupComplete = true;
}

static void STM32F_SystemCore_setup_poofajo(stm32cube_blocks_TimerBlock_S_T *obj)
{
  TIM_Type_T b;
  boolean_T isSlaveModeTriggerEnabled;

  /* Start for MATLABSystem: '<Root>/Timer' */
  obj->isInitialized = 1;
  b.PeripheralPtr = TIM6;
  b.isCenterAlignedMode = false;

  /* Start for MATLABSystem: '<Root>/Timer' */
  b.repetitionCounter = 0U;
  obj->TimerHandle = Timer_Handle_Init(&b);
  enableTimerInterrupts(obj->TimerHandle, 0);
  isSlaveModeTriggerEnabled = isSlaveTriggerModeEnabled(obj->TimerHandle);
  if (!isSlaveModeTriggerEnabled) {
    /* Start for MATLABSystem: '<Root>/Timer' */
    enableCounter(obj->TimerHandle, false);
  }

  obj->isSetupComplete = true;
}

/* Model step function for TID0 */
void STM32F415_master_ST_step0(void)   /* Sample time: [0.000125s, 0.0s] */
{
  {                                    /* Sample time: [0.000125s, 0.0s] */
    rate_monotonic_scheduler();
  }
}

/* Model step function for TID1 */
void STM32F415_master_ST_step1(void)   /* Sample time: [0.00025s, 0.0s] */
{
  int32_T dataInLen;
  int32_T i;
  int32_T i_0;
  uint32_T dataBytesToRead;
  uint32_T sentLength;
  uint16_T b_varargout_2;
  uint8_T b_varargout_3;
  uint8_T uartReadData;

  /* MATLABSystem: '<Root>/UART//USART Read6' */
  dataBytesToRead = getBytesToBeReadFromBuffer
    (STM32F415_master_ST_DW.obj_d.UARTHandle, 1U, 0U);
  if (dataBytesToRead > 0U) {
    MW_UART_ReceiveUsingBuffer(STM32F415_master_ST_DW.obj_d.UARTHandle,
      &uartReadData, dataBytesToRead, &sentLength);
  } else {
    getReadErrorStatus(STM32F415_master_ST_DW.obj_d.UARTHandle);
    sentLength = 0U;
  }

  /* Outputs for Enabled SubSystem: '<Root>/Enabled Subsystem' incorporates:
   *  EnablePort: '<S4>/Enable'
   */
  /* RelationalOperator: '<S1>/Compare' incorporates:
   *  Constant: '<S11>/Constant'
   *  Constant: '<S12>/Constant'
   *  Constant: '<S14>/Constant'
   *  Constant: '<S15>/Constant'
   *  Constant: '<S17>/Constant'
   *  Constant: '<S18>/Constant'
   *  Constant: '<S1>/Constant'
   *  Logic: '<S10>/AND'
   *  Logic: '<S8>/AND'
   *  Logic: '<S9>/AND'
   *  MATLAB Function: '<S19>/MATLAB Function'
   *  MATLABSystem: '<Root>/UART//USART Read6'
   *  MATLABSystem: '<S4>/MATLAB System'
   *  RelationalOperator: '<S11>/Compare'
   *  RelationalOperator: '<S12>/Compare'
   *  RelationalOperator: '<S14>/Compare'
   *  RelationalOperator: '<S15>/Compare'
   *  RelationalOperator: '<S17>/Compare'
   *  RelationalOperator: '<S18>/Compare'
   * */
  if (sentLength > STM32F415_master_ST_P.Constant_Value_o) {
    /* MATLABSystem: '<S4>/MATLAB System' */
    /*  Initialize output data and its length */
    memcpy(&STM32F415_master_ST_B.b_varargout_1[0],
           &STM32F415_master_ST_DW.obj.zeroBuffer[0], 300U * sizeof(uint8_T));
    b_varargout_2 = 0U;
    b_varargout_3 = 0U;

    /*  Check for double start symbol to begin */
    if ((uartReadData == STM32F415_master_ST_DW.obj.startSymbol) &&
        (!STM32F415_master_ST_DW.obj.isDetecting)) {
      /*  Reset system state */
      memset(&STM32F415_master_ST_DW.obj.buffer[0], 0, 300U * sizeof(uint8_T));
      STM32F415_master_ST_DW.obj.pointer = 1U;
      STM32F415_master_ST_DW.obj.preambleLength = 0U;
      STM32F415_master_ST_DW.obj.isDetecting = true;
    }

    /*  Store symbols in buffer if detecting */
    if (STM32F415_master_ST_DW.obj.isDetecting) {
      STM32F415_master_ST_DW.obj.buffer[STM32F415_master_ST_DW.obj.pointer - 1] =
        uartReadData;

      /*  Determine the preamble length from the 4th byte */
      if (STM32F415_master_ST_DW.obj.pointer == 5) {
        /*  Check if the input is a vector of two uint8 elements */
        /*  Extract the lower and upper uint8 values from the input vector */
        /*  Combine the two uint8 values into one uint16 value */
        sentLength = (uint32_T)(STM32F415_master_ST_DW.obj.buffer[4] << 8 |
          STM32F415_master_ST_DW.obj.buffer[3]) + 5U;
        if (sentLength > 65535U) {
          sentLength = 65535U;
        }

        STM32F415_master_ST_DW.obj.preambleLength = (uint16_T)sentLength;
      }

      sentLength = STM32F415_master_ST_DW.obj.pointer + 1U;
      if (STM32F415_master_ST_DW.obj.pointer + 1U > 65535U) {
        sentLength = 65535U;
      }

      STM32F415_master_ST_DW.obj.pointer = (uint16_T)sentLength;

      /*  Check if a complete preamble is detected */
      i = (int32_T)(STM32F415_master_ST_DW.obj.pointer - /*MW:OvSatOk*/ 1U);
      if (STM32F415_master_ST_DW.obj.pointer - 1U >
          STM32F415_master_ST_DW.obj.pointer) {
        i = 0;
      }

      if (i == STM32F415_master_ST_DW.obj.preambleLength) {
        sentLength = STM32F415_master_ST_DW.obj.pointer + 4U;
        if (STM32F415_master_ST_DW.obj.pointer + 4U > 65535U) {
          sentLength = 65535U;
        }

        if ((uint16_T)sentLength < 6) {
          i = 0;
          dataInLen = -1;
        } else {
          i = 5;
          dataInLen = (uint16_T)sentLength - 1;
        }

        dataInLen -= i;
        for (i_0 = 0; i_0 <= dataInLen; i_0++) {
          STM32F415_master_ST_B.b_varargout_1[i_0] =
            STM32F415_master_ST_DW.obj.buffer[i + i_0];
        }

        sentLength = STM32F415_master_ST_DW.obj.pointer - 6U;
        if (STM32F415_master_ST_DW.obj.pointer - 6U >
            STM32F415_master_ST_DW.obj.pointer) {
          sentLength = 0U;
        }

