skocharyan/Mux/code/STM32F415_master_ST_ert_rtw/STM32F415_master_ST.c
        b_varargout_2 = (uint16_T)sentLength;
        b_varargout_3 = STM32F415_master_ST_DW.obj.buffer[2];

        /*  Reset system state */
        memset(&STM32F415_master_ST_DW.obj.buffer[0], 0, 300U * sizeof(uint8_T));
        STM32F415_master_ST_DW.obj.pointer = 1U;
        STM32F415_master_ST_DW.obj.isDetecting = false;
        STM32F415_master_ST_DW.obj.preambleLength = 0U;
      }
    }

    /*  Handle buffer overflow */
    if (STM32F415_master_ST_DW.obj.pointer > 300) {
      /*  Reset system state */
      memset(&STM32F415_master_ST_DW.obj.buffer[0], 0, 300U * sizeof(uint8_T));
      STM32F415_master_ST_DW.obj.pointer = 1U;
      STM32F415_master_ST_DW.obj.isDetecting = false;
      STM32F415_master_ST_DW.obj.preambleLength = 0U;
    }

    /* Outputs for Enabled SubSystem: '<S8>/Subsystem' incorporates:
     *  EnablePort: '<S13>/Enable'
     */
    if ((b_varargout_2 > STM32F415_master_ST_P.Constant_Value_b) &&
        (b_varargout_3 == STM32F415_master_ST_P.CompareToConstant_const)) {
      /* MATLABSystem: '<S13>/UART//USART Write' */
      dataInLen = 300;
      if (b_varargout_2 < 300U) {
        dataInLen = b_varargout_2;
      }

      memcpy(&STM32F415_master_ST_B.uartWriteData_m[0],
             &STM32F415_master_ST_B.b_varargout_1[0], 300U * sizeof(uint8_T));
      MW_UART_TransmitUsingInterrupt(STM32F415_master_ST_DW.obj_pi.UARTHandle,
        &STM32F415_master_ST_B.uartWriteData_m[0], (uint32_T)dataInLen, 0U,
        &sentLength);

      /* End of MATLABSystem: '<S13>/UART//USART Write' */
    }

    /* End of Outputs for SubSystem: '<S8>/Subsystem' */

    /* Outputs for Enabled SubSystem: '<S9>/Subsystem' incorporates:
     *  EnablePort: '<S16>/Enable'
     */
    if ((b_varargout_2 > STM32F415_master_ST_P.Constant_Value_c) &&
        (b_varargout_3 == STM32F415_master_ST_P.CompareToConstant_const_m)) {
      /* MATLABSystem: '<S16>/UART//USART Write' */
      dataInLen = 300;
      if (b_varargout_2 < 300U) {
        dataInLen = b_varargout_2;
      }

      memcpy(&STM32F415_master_ST_B.uartWriteData_m[0],
             &STM32F415_master_ST_B.b_varargout_1[0], 300U * sizeof(uint8_T));
      MW_UART_TransmitUsingInterrupt(STM32F415_master_ST_DW.obj_nc.UARTHandle,
        &STM32F415_master_ST_B.uartWriteData_m[0], (uint32_T)dataInLen, 0U,
        &sentLength);

      /* End of MATLABSystem: '<S16>/UART//USART Write' */
    }

    /* End of Outputs for SubSystem: '<S9>/Subsystem' */

    /* Outputs for Enabled SubSystem: '<S10>/Subsystem' incorporates:
     *  EnablePort: '<S19>/Enable'
     */
    if ((b_varargout_2 > STM32F415_master_ST_P.Constant_Value_a) &&
        (b_varargout_3 == STM32F415_master_ST_P.CompareToConstant_const_e)) {
      /* Outputs for Enabled SubSystem: '<S19>/Subsystem' incorporates:
       *  EnablePort: '<S21>/Enable'
       */
      if ((STM32F415_master_ST_B.b_varargout_1[0] == 15) &&
          ((STM32F415_master_ST_B.b_varargout_1[24] == 0) &&
           (STM32F415_master_ST_B.b_varargout_1[23] == 0))) {
        /* DataStoreWrite: '<S21>/Data Store Write' */
        memcpy(&STM32F415_master_ST_SharedDSM.sbusSignal[0],
               &STM32F415_master_ST_B.b_varargout_1[0], 300U * sizeof(uint8_T));

        /* DataStoreWrite: '<S21>/Data Store Write2' */
        STM32F415_master_ST_SharedDSM.sbusLengrh = b_varargout_2;
      }

      /* End of Outputs for SubSystem: '<S19>/Subsystem' */
    }

    /* End of Outputs for SubSystem: '<S10>/Subsystem' */
  }

  /* End of RelationalOperator: '<S1>/Compare' */
  /* End of Outputs for SubSystem: '<Root>/Enabled Subsystem' */
}

/* Model step function for TID2 */
void STM32F415_master_ST_step2(void)   /* Sample time: [0.000375s, 0.0s] */
{
  int32_T i;
  uint32_T dataBytesToRead;
  uint32_T sentLength;
  uint16_T b_varargout_2;
  uint8_T uartReadData;

  /* MATLABSystem: '<Root>/MAV Receiver' */
  dataBytesToRead = getBytesToBeReadFromBuffer
    (STM32F415_master_ST_DW.obj_n.UARTHandle, 1U, 0U);
  if (dataBytesToRead > 0U) {
    MW_UART_ReceiveUsingBuffer(STM32F415_master_ST_DW.obj_n.UARTHandle,
      &uartReadData, dataBytesToRead, &sentLength);
  } else {
    getReadErrorStatus(STM32F415_master_ST_DW.obj_n.UARTHandle);
    sentLength = 0U;
  }

  /* Outputs for Enabled SubSystem: '<Root>/Mav Deserializer' incorporates:
   *  EnablePort: '<S7>/Enable'
   */
  /* RelationalOperator: '<S2>/Compare' incorporates:
   *  Constant: '<S2>/Constant'
   *  MATLABSystem: '<Root>/MAV Receiver'
   * */
  if (sentLength > STM32F415_master_ST_P.Constant_Value_d) {
    /* MATLABSystem: '<S7>/MATLAB System' */
    /*  Initialize output data and its length */
    memcpy(&STM32F415_master_ST_B.b_varargout_1_c[0],
           &STM32F415_master_ST_DW.obj_g.emptyBuffer[0], 300U * sizeof(uint8_T));
    b_varargout_2 = 0U;

    /*  Check for start symbol to begin capturing */
    if ((uartReadData == STM32F415_master_ST_DW.obj_g.startSymbol) &&
        (!STM32F415_master_ST_DW.obj_g.isCapturing)) {
      STM32F415_master_ST_DW.obj_g.isCapturing = true;
    }

    /*  strt capturing process */
    if (STM32F415_master_ST_DW.obj_g.isCapturing) {
      STM32F415_master_ST_DW.obj_g.buffer[STM32F415_master_ST_DW.obj_g.pointer -
        1] = uartReadData;
      if (STM32F415_master_ST_DW.obj_g.pointer == 2) {
        STM32F415_master_ST_DW.obj_g.mavFrameLength = (uint16_T)
          (STM32F415_master_ST_DW.obj_g.buffer[1] + 12U);
      }

      /*  increment the pointer */
      sentLength = STM32F415_master_ST_DW.obj_g.pointer + 1U;
      if (STM32F415_master_ST_DW.obj_g.pointer + 1U > 65535U) {
        sentLength = 65535U;
      }

      STM32F415_master_ST_DW.obj_g.pointer = (uint16_T)sentLength;

      /*  detect the end of the message */
      i = (int32_T)(STM32F415_master_ST_DW.obj_g.pointer - 1U);
      if (STM32F415_master_ST_DW.obj_g.pointer - 1U >
          STM32F415_master_ST_DW.obj_g.pointer) {
        i = 0;
      }

      if (STM32F415_master_ST_DW.obj_g.mavFrameLength == i) {
        i = (int32_T)(STM32F415_master_ST_DW.obj_g.pointer - 1U);
        if (STM32F415_master_ST_DW.obj_g.pointer - 1U >
            STM32F415_master_ST_DW.obj_g.pointer) {
          i = 0;
        }

        b_varargout_2 = (uint16_T)i;

