skocharyan/Mux/code/STM32F415_master_ST_ert_rtw/STM32F415_master_ST.c
        /*  Reset system state */
        for (i = 0; i < 300; i++) {
          STM32F415_master_ST_B.b_varargout_1_c[i] =
            STM32F415_master_ST_DW.obj_g.buffer[i];
          STM32F415_master_ST_DW.obj_g.buffer[i] = 0U;
        }

        STM32F415_master_ST_DW.obj_g.pointer = 1U;
        STM32F415_master_ST_DW.obj_g.isCapturing = false;
        STM32F415_master_ST_DW.obj_g.mavFrameLength = 0U;
      }

      /*  Handle buffer overflow */
      if (STM32F415_master_ST_DW.obj_g.pointer >= 300) {
        /*  Reset system state */
        memset(&STM32F415_master_ST_DW.obj_g.buffer[0], 0, 300U * sizeof(uint8_T));
        STM32F415_master_ST_DW.obj_g.pointer = 1U;
        STM32F415_master_ST_DW.obj_g.isCapturing = false;
        STM32F415_master_ST_DW.obj_g.mavFrameLength = 0U;
      }
    }

    /* RelationalOperator: '<S24>/Compare' incorporates:
     *  Constant: '<S24>/Constant'
     *  MATLABSystem: '<S7>/MATLAB System'
     * */
    STM32F415_master_ST_B.Compare = (b_varargout_2 >
      STM32F415_master_ST_P.Constant_Value_f4);

    /* Outputs for Enabled SubSystem: '<S7>/Enabled Subsystem' incorporates:
     *  EnablePort: '<S25>/Enable'
     */
    if (STM32F415_master_ST_B.Compare) {
      /* Start for MATLABSystem: '<S25>/Mav Frame Encoder' incorporates:
       *  MATLABSystem: '<S7>/MATLAB System'
       * */
      /*  Check if the input is of type uint16 */
      /*  Extract lower 8 bits (least significant byte) */
      /*  255 is 0xFF in hexadecimal */
      /*  Extract upper 8 bits (most significant byte) */
      /*  Shift right by 8 bits and mask with 0xFF */
      /*  Convert to uint8 */
      /*  Create a vector of two uint8 elements */
      sentLength = b_varargout_2 + 5U;
      if (b_varargout_2 + 5U > 65535U) {
        sentLength = 65535U;
      }

      /* MATLABSystem: '<S25>/UART//USART Write' incorporates:
       *  MATLABSystem: '<S25>/Mav Frame Encoder'
       *  MATLABSystem: '<S7>/MATLAB System'
       * */
      i = 305;
      if ((uint16_T)sentLength < 305U) {
        i = (uint16_T)sentLength;
      }

      STM32F415_master_ST_B.uartWriteData[0] = 206U;
      STM32F415_master_ST_B.uartWriteData[1] = 206U;
      STM32F415_master_ST_B.uartWriteData[2] = 1U;
      STM32F415_master_ST_B.uartWriteData[3] = (uint8_T)(b_varargout_2 & 255);
      STM32F415_master_ST_B.uartWriteData[4] = (uint8_T)((uint32_T)b_varargout_2
        >> 8);
      memcpy(&STM32F415_master_ST_B.uartWriteData[5],
             &STM32F415_master_ST_B.b_varargout_1_c[0], 300U * sizeof(uint8_T));
      MW_UART_TransmitUsingInterrupt(STM32F415_master_ST_DW.obj_p.UARTHandle,
        &STM32F415_master_ST_B.uartWriteData[0], (uint32_T)i, 0U, &sentLength);

      /* End of MATLABSystem: '<S25>/UART//USART Write' */
    }

    /* End of Outputs for SubSystem: '<S7>/Enabled Subsystem' */

    /* S-Function (resetState): '<S7>/S-Function Builder1' */
    resetState_Outputs_wrapper(&STM32F415_master_ST_B.Compare);
  }

  /* End of RelationalOperator: '<S2>/Compare' */
  /* End of Outputs for SubSystem: '<Root>/Mav Deserializer' */
}

/* Model step function for TID3 */
void STM32F415_master_ST_step3(void)   /* Sample time: [0.0015s, 0.0s] */
{
  int32_T dataInLen;
  int32_T i;
  uint32_T dataBytesToRead;
  uint32_T sentLength;
  uint16_T b_varargout_2;
  uint8_T uartReadData;

  /* MATLABSystem: '<Root>/AT Receiver' */
  dataBytesToRead = getBytesToBeReadFromBuffer
    (STM32F415_master_ST_DW.obj_e.UARTHandle, 1U, 0U);
  if (dataBytesToRead > 0U) {
    MW_UART_ReceiveUsingBuffer(STM32F415_master_ST_DW.obj_e.UARTHandle,
      &uartReadData, dataBytesToRead, &sentLength);
  } else {
    getReadErrorStatus(STM32F415_master_ST_DW.obj_e.UARTHandle);
    sentLength = 0U;
  }

  /* Outputs for Enabled SubSystem: '<Root>/Enabled Subsystem2' incorporates:
   *  EnablePort: '<S6>/Enable'
   */
  /* RelationalOperator: '<S3>/Compare' incorporates:
   *  Constant: '<S22>/Constant'
   *  Constant: '<S3>/Constant'
   *  MATLABSystem: '<Root>/AT Receiver'
   *  MATLABSystem: '<S6>/MATLAB System'
   *  RelationalOperator: '<S22>/Compare'
   * */
  if (sentLength > STM32F415_master_ST_P.Constant_Value) {
    if (!STM32F415_master_ST_DW.EnabledSubsystem2_MODE) {
      /* InitializeConditions for MATLABSystem: '<S6>/MATLAB System' */
      for (i = 0; i < 50; i++) {
        STM32F415_master_ST_DW.obj_m.buffer[i] = 0U;
      }

      STM32F415_master_ST_DW.obj_m.pointer = 1U;

      /* End of InitializeConditions for MATLABSystem: '<S6>/MATLAB System' */
      STM32F415_master_ST_DW.EnabledSubsystem2_MODE = true;
    }

    /* MATLABSystem: '<S6>/MATLAB System' */
    for (i = 0; i < 50; i++) {
      STM32F415_master_ST_B.b_varargout_1_b[i] =
        STM32F415_master_ST_DW.obj_m.zeroBuffer[i];
    }

    b_varargout_2 = 0U;

    /*  Changed to uint16 to avoid overflow */
    /*  Store the incoming symbol in the buffer */
    if (STM32F415_master_ST_DW.obj_m.pointer <= 50) {
      STM32F415_master_ST_DW.obj_m.buffer[STM32F415_master_ST_DW.obj_m.pointer -
        1] = uartReadData;
      STM32F415_master_ST_DW.obj_m.pointer++;
    } else {
      /*  Reset the system if buffer overflows */
      for (i = 0; i < 50; i++) {
        STM32F415_master_ST_DW.obj_m.buffer[i] = 0U;
      }

      STM32F415_master_ST_DW.obj_m.pointer = 1U;
    }

    /*  Check if the incoming symbol is the end symbol */
    if (uartReadData == 75) {
      /*  Set the output data to the content of the buffer up to the current pointer */
      i = (int32_T)(STM32F415_master_ST_DW.obj_m.pointer - /*MW:OvSatOk*/ 1U);
      if (STM32F415_master_ST_DW.obj_m.pointer - 1U >
          STM32F415_master_ST_DW.obj_m.pointer) {
        i = 0;
      }

      b_varargout_2 = (uint16_T)i;

      /*  Set the output data length */
      /*  Reset the system */
      for (i = 0; i < 50; i++) {
        STM32F415_master_ST_B.b_varargout_1_b[i] =
          STM32F415_master_ST_DW.obj_m.buffer[i];
        STM32F415_master_ST_DW.obj_m.buffer[i] = 0U;
      }

      STM32F415_master_ST_DW.obj_m.pointer = 1U;
    }

