skocharyan/Mux/code/STM32F415_master_ST_ert_rtw/STM32F415_master_ST.c
    /* Outputs for Enabled SubSystem: '<S6>/Enabled Subsystem' incorporates:
     *  EnablePort: '<S23>/Enable'
     */
    if (b_varargout_2 > STM32F415_master_ST_P.Constant_Value_f) {
      /* MATLABSystem: '<S23>/UART//USART Write' incorporates:
       *  MATLABSystem: '<S23>/AT response encoder'
       * */
      /*  Check if the input is of type uint16 */
      /*  Extract lower 8 bits (least significant byte) */
      /*  255 is 0xFF in hexadecimal */
      /*  Extract upper 8 bits (most significant byte) */
      /*  Shift right by 8 bits and mask with 0xFF */
      /*  Convert to uint8 */
      /*  Create a vector of two uint8 elements */
      dataInLen = 55;
      if (b_varargout_2 + 5U < 55U) {
        dataInLen = (int32_T)(b_varargout_2 + 5U);
      }

      STM32F415_master_ST_B.uartWriteData_c[0] = 206U;
      STM32F415_master_ST_B.uartWriteData_c[1] = 206U;
      STM32F415_master_ST_B.uartWriteData_c[2] = 2U;
      STM32F415_master_ST_B.uartWriteData_c[3] = (uint8_T)b_varargout_2;
      STM32F415_master_ST_B.uartWriteData_c[4] = 0U;
      for (i = 0; i < 50; i++) {
        STM32F415_master_ST_B.uartWriteData_c[i + 5] =
          STM32F415_master_ST_B.b_varargout_1_b[i];
      }

      MW_UART_TransmitUsingInterrupt(STM32F415_master_ST_DW.obj_ep.UARTHandle,
        &STM32F415_master_ST_B.uartWriteData_c[0], (uint32_T)dataInLen, 0U,
        &sentLength);

      /* End of MATLABSystem: '<S23>/UART//USART Write' */
    }

    /* End of Outputs for SubSystem: '<S6>/Enabled Subsystem' */
  } else {
    STM32F415_master_ST_DW.EnabledSubsystem2_MODE = false;
  }

  /* End of RelationalOperator: '<S3>/Compare' */
  /* End of Outputs for SubSystem: '<Root>/Enabled Subsystem2' */
}

/* Model step function for TID4 */
void STM32F415_master_ST_step4(void)   /* Sample time: [0.01s, 0.0s] */
{
  int32_T dataInLen;
  uint32_T counts;

  /* MATLABSystem: '<Root>/Timer' */
  counts = getTimerCounterValue(STM32F415_master_ST_DW.obj_d2.TimerHandle);

  /* Outputs for Enabled SubSystem: '<Root>/Enabled Subsystem1' incorporates:
   *  EnablePort: '<S5>/Enable'
   */
  if (counts > 0U) {
    /* MATLABSystem: '<S5>/UART//USART Write' incorporates:
     *  DataStoreRead: '<S5>/Data Store Read'
     *  DataStoreRead: '<S5>/Data Store Read1'
     */
    dataInLen = 300;
    if (STM32F415_master_ST_SharedDSM.sbusLengrh < 300U) {
      dataInLen = STM32F415_master_ST_SharedDSM.sbusLengrh;
    }

    memcpy(&STM32F415_master_ST_B.uartWriteData_k[0],
           &STM32F415_master_ST_SharedDSM.sbusSignal[0], 300U * sizeof(uint8_T));
    MW_UART_TransmitUsingInterrupt(STM32F415_master_ST_DW.obj_ps.UARTHandle,
      &STM32F415_master_ST_B.uartWriteData_k[0], (uint32_T)dataInLen, 0U,
      &counts);

    /* End of MATLABSystem: '<S5>/UART//USART Write' */
  }

  /* End of MATLABSystem: '<Root>/Timer' */
  /* End of Outputs for SubSystem: '<Root>/Enabled Subsystem1' */
}

/* Model initialize function */
void STM32F415_master_ST_initialize(void)
{
  {
    int32_T i;

    /* Start for DataStoreMemory: '<Root>/Data Store Memory' */
    for (i = 0; i < 300; i++) {
      STM32F415_master_ST_SharedDSM.sbusSignal[i] =
        STM32F415_master_ST_P.DataStoreMemory_InitialValue;
    }

    /* End of Start for DataStoreMemory: '<Root>/Data Store Memory' */

    /* Start for DataStoreMemory: '<Root>/Data Store Memory1' */
    STM32F415_master_ST_SharedDSM.sbusLengrh =
      STM32F415_master_ST_P.DataStoreMemory1_InitialValue;

    /* SystemInitialize for Enabled SubSystem: '<Root>/Enabled Subsystem2' */
    /* SystemInitialize for Enabled SubSystem: '<S6>/Enabled Subsystem' */
    /* Start for MATLABSystem: '<S23>/UART//USART Write' */
    /*  Constructor */
    /*  Support name-value pair arguments when constructing object */
    /*         %% Common functions */
    STM32F415_master_ST_DW.obj_ep.isInitialized = 0;
    STM32F415_master_ST_DW.obj_ep.matlabCodegenIsDeleted = false;
    STM32F415_SystemCore_setup_poof(&STM32F415_master_ST_DW.obj_ep);

    /* End of SystemInitialize for SubSystem: '<S6>/Enabled Subsystem' */

    /* Start for MATLABSystem: '<S6>/MATLAB System' */
    /*  Constructor */
    /*  Support name-value pair arguments when constructing object */
    STM32F415_master_ST_DW.obj_m.isInitialized = 1;

    /*  Return false if input size cannot change */
    /*  between calls to the System object */
    /*         %% Common functions */
    for (i = 0; i < 50; i++) {
      STM32F415_master_ST_DW.obj_m.zeroBuffer[i] = 0U;

      /* InitializeConditions for MATLABSystem: '<S6>/MATLAB System' */
      STM32F415_master_ST_DW.obj_m.buffer[i] = 0U;
    }

    /* InitializeConditions for MATLABSystem: '<S6>/MATLAB System' */
    STM32F415_master_ST_DW.obj_m.pointer = 1U;

    /* End of SystemInitialize for SubSystem: '<Root>/Enabled Subsystem2' */

    /* SystemInitialize for Enabled SubSystem: '<Root>/Enabled Subsystem' */
    /* SystemInitialize for Enabled SubSystem: '<S8>/Subsystem' */
    /* Start for MATLABSystem: '<S13>/UART//USART Write' */
    STM32F415_master_ST_DW.obj_pi.isInitialized = 0;
    STM32F415_master_ST_DW.obj_pi.matlabCodegenIsDeleted = false;
    STM32F415_ma_SystemCore_setup_p(&STM32F415_master_ST_DW.obj_pi);

    /* End of SystemInitialize for SubSystem: '<S8>/Subsystem' */

    /* SystemInitialize for Enabled SubSystem: '<S9>/Subsystem' */
    /* Start for MATLABSystem: '<S16>/UART//USART Write' */
    STM32F415_master_ST_DW.obj_nc.isInitialized = 0;
    STM32F415_master_ST_DW.obj_nc.matlabCodegenIsDeleted = false;
    STM32F415_m_SystemCore_setup_po(&STM32F415_master_ST_DW.obj_nc);

    /* End of SystemInitialize for SubSystem: '<S9>/Subsystem' */

    /* Start for MATLABSystem: '<S4>/MATLAB System' */
    STM32F415_master_ST_DW.obj.startSymbol = 206U;

    /*  Constructor */
    /*  Support name-value pair arguments when constructing object */
    STM32F415_master_ST_DW.obj.isInitialized = 1;

    /*  Return false if input size cannot change */
    /*         %% Common functions */
    /*  Initialize the buffer */
    /*  Initialize / reset internal or discrete properties */
    /*  Reset system state */
    memset(&STM32F415_master_ST_DW.obj.zeroBuffer[0], 0, 300U * sizeof(uint8_T));

    /* InitializeConditions for MATLABSystem: '<S4>/MATLAB System' */
    memset(&STM32F415_master_ST_DW.obj.buffer[0], 0, 300U * sizeof(uint8_T));
    STM32F415_master_ST_DW.obj.pointer = 1U;
    STM32F415_master_ST_DW.obj.isDetecting = false;
    STM32F415_master_ST_DW.obj.preambleLength = 0U;

