skocharyan/Mux/code/STM32F415_master_ST_ert_rtw/STM32F415_master_ST.c
    /* End of SystemInitialize for SubSystem: '<Root>/Enabled Subsystem' */

    /* SystemInitialize for Enabled SubSystem: '<Root>/Mav Deserializer' */
    /* SystemInitialize for Enabled SubSystem: '<S7>/Enabled Subsystem' */
    /* Start for MATLABSystem: '<S25>/UART//USART Write' */
    /*  Constructor */
    /*  Support name-value pair arguments when constructing object */
    /*         %% Common functions */
    STM32F415_master_ST_DW.obj_p.isInitialized = 0;
    STM32F415_master_ST_DW.obj_p.matlabCodegenIsDeleted = false;
    STM32F415_SystemCore_setup_poof(&STM32F415_master_ST_DW.obj_p);

    /* End of SystemInitialize for SubSystem: '<S7>/Enabled Subsystem' */

    /* Start for MATLABSystem: '<S7>/MATLAB System' */
    STM32F415_master_ST_DW.obj_g.startSymbol = 253U;
    STM32F415_master_ST_DW.obj_g.pointer = 1U;
    STM32F415_master_ST_DW.obj_g.isCapturing = false;
    STM32F415_master_ST_DW.obj_g.mavFrameLength = 0U;

    /*  Constructor */
    /*  Support name-value pair arguments when constructing object */
    STM32F415_master_ST_DW.obj_g.isInitialized = 1;

    /*  Return false if input size cannot change */
    /*         %% Common functions */
    memset(&STM32F415_master_ST_DW.obj_g.emptyBuffer[0], 0, 300U * sizeof
           (uint8_T));
    memset(&STM32F415_master_ST_DW.obj_g.buffer[0], 0, 300U * sizeof(uint8_T));

    /* End of SystemInitialize for SubSystem: '<Root>/Mav Deserializer' */

    /* SystemInitialize for Enabled SubSystem: '<Root>/Enabled Subsystem1' */
    /* Start for MATLABSystem: '<S5>/UART//USART Write' */
    STM32F415_master_ST_DW.obj_ps.isInitialized = 0;
    STM32F415_master_ST_DW.obj_ps.matlabCodegenIsDeleted = false;
    STM32F415__SystemCore_setup_poo(&STM32F415_master_ST_DW.obj_ps);

    /* End of SystemInitialize for SubSystem: '<Root>/Enabled Subsystem1' */

    /* Start for MATLABSystem: '<Root>/UART//USART Read6' */
    STM32F415_master_ST_DW.obj_d.isInitialized = 0;
    STM32F415_master_ST_DW.obj_d.matlabCodegenIsDeleted = false;
    STM32_SystemCore_setup_poofajod(&STM32F415_master_ST_DW.obj_d);

    /* Start for MATLABSystem: '<Root>/MAV Receiver' */
    STM32F415_master_ST_DW.obj_n.isInitialized = 0;
    STM32F415_master_ST_DW.obj_n.matlabCodegenIsDeleted = false;
    STM32F41_SystemCore_setup_poofa(&STM32F415_master_ST_DW.obj_n);

    /* Start for MATLABSystem: '<Root>/AT Receiver' */
    STM32F415_master_ST_DW.obj_e.isInitialized = 0;
    STM32F415_master_ST_DW.obj_e.matlabCodegenIsDeleted = false;
    STM32F415_mast_SystemCore_setup(&STM32F415_master_ST_DW.obj_e);

    /* Start for MATLABSystem: '<Root>/Timer' */
    STM32F415_master_ST_DW.obj_d2.isInitialized = 0;
    STM32F415_master_ST_DW.obj_d2.matlabCodegenIsDeleted = false;
    STM32F_SystemCore_setup_poofajo(&STM32F415_master_ST_DW.obj_d2);
  }
}

/* Model terminate function */
void STM32F415_master_ST_terminate(void)
{
  /* Terminate for MATLABSystem: '<Root>/UART//USART Read6' */
  if (!STM32F415_master_ST_DW.obj_d.matlabCodegenIsDeleted) {
    STM32F415_master_ST_DW.obj_d.matlabCodegenIsDeleted = true;
    if ((STM32F415_master_ST_DW.obj_d.isInitialized == 1) &&
        STM32F415_master_ST_DW.obj_d.isSetupComplete) {
      MW_UART_DeInit(STM32F415_master_ST_DW.obj_d.UARTHandle);
    }
  }

  /* End of Terminate for MATLABSystem: '<Root>/UART//USART Read6' */

  /* Terminate for Enabled SubSystem: '<Root>/Enabled Subsystem' */
  /* Terminate for Enabled SubSystem: '<S8>/Subsystem' */
  /* Terminate for MATLABSystem: '<S13>/UART//USART Write' */
  if (!STM32F415_master_ST_DW.obj_pi.matlabCodegenIsDeleted) {
    STM32F415_master_ST_DW.obj_pi.matlabCodegenIsDeleted = true;
    if ((STM32F415_master_ST_DW.obj_pi.isInitialized == 1) &&
        STM32F415_master_ST_DW.obj_pi.isSetupComplete) {
      MW_UART_DeInit(STM32F415_master_ST_DW.obj_pi.UARTHandle);
    }
  }

  /* End of Terminate for MATLABSystem: '<S13>/UART//USART Write' */
  /* End of Terminate for SubSystem: '<S8>/Subsystem' */

  /* Terminate for Enabled SubSystem: '<S9>/Subsystem' */
  /* Terminate for MATLABSystem: '<S16>/UART//USART Write' */
  if (!STM32F415_master_ST_DW.obj_nc.matlabCodegenIsDeleted) {
    STM32F415_master_ST_DW.obj_nc.matlabCodegenIsDeleted = true;
    if ((STM32F415_master_ST_DW.obj_nc.isInitialized == 1) &&
        STM32F415_master_ST_DW.obj_nc.isSetupComplete) {
      MW_UART_DeInit(STM32F415_master_ST_DW.obj_nc.UARTHandle);
    }
  }

  /* End of Terminate for MATLABSystem: '<S16>/UART//USART Write' */
  /* End of Terminate for SubSystem: '<S9>/Subsystem' */
  /* End of Terminate for SubSystem: '<Root>/Enabled Subsystem' */

  /* Terminate for MATLABSystem: '<Root>/MAV Receiver' */
  if (!STM32F415_master_ST_DW.obj_n.matlabCodegenIsDeleted) {
    STM32F415_master_ST_DW.obj_n.matlabCodegenIsDeleted = true;
    if ((STM32F415_master_ST_DW.obj_n.isInitialized == 1) &&
        STM32F415_master_ST_DW.obj_n.isSetupComplete) {
      MW_UART_DeInit(STM32F415_master_ST_DW.obj_n.UARTHandle);
    }
  }

  /* End of Terminate for MATLABSystem: '<Root>/MAV Receiver' */

  /* Terminate for Enabled SubSystem: '<Root>/Mav Deserializer' */
  /* Terminate for Enabled SubSystem: '<S7>/Enabled Subsystem' */
  /* Terminate for MATLABSystem: '<S25>/UART//USART Write' */
  if (!STM32F415_master_ST_DW.obj_p.matlabCodegenIsDeleted) {
    STM32F415_master_ST_DW.obj_p.matlabCodegenIsDeleted = true;
    if ((STM32F415_master_ST_DW.obj_p.isInitialized == 1) &&
        STM32F415_master_ST_DW.obj_p.isSetupComplete) {
      MW_UART_DeInit(STM32F415_master_ST_DW.obj_p.UARTHandle);
    }
  }

  /* End of Terminate for MATLABSystem: '<S25>/UART//USART Write' */
  /* End of Terminate for SubSystem: '<S7>/Enabled Subsystem' */
  /* End of Terminate for SubSystem: '<Root>/Mav Deserializer' */

  /* Terminate for MATLABSystem: '<Root>/AT Receiver' */
  if (!STM32F415_master_ST_DW.obj_e.matlabCodegenIsDeleted) {
    STM32F415_master_ST_DW.obj_e.matlabCodegenIsDeleted = true;
    if ((STM32F415_master_ST_DW.obj_e.isInitialized == 1) &&
        STM32F415_master_ST_DW.obj_e.isSetupComplete) {
      MW_UART_DeInit(STM32F415_master_ST_DW.obj_e.UARTHandle);
    }
  }

