skocharyan/Mux/code/STM32F415_master_ST_ert_rtw/STM32F415_master_ST.c
  /* End of Terminate for MATLABSystem: '<Root>/AT Receiver' */

  /* Terminate for Enabled SubSystem: '<Root>/Enabled Subsystem2' */
  /* Terminate for Enabled SubSystem: '<S6>/Enabled Subsystem' */
  /* Terminate for MATLABSystem: '<S23>/UART//USART Write' */
  if (!STM32F415_master_ST_DW.obj_ep.matlabCodegenIsDeleted) {
    STM32F415_master_ST_DW.obj_ep.matlabCodegenIsDeleted = true;
    if ((STM32F415_master_ST_DW.obj_ep.isInitialized == 1) &&
        STM32F415_master_ST_DW.obj_ep.isSetupComplete) {
      MW_UART_DeInit(STM32F415_master_ST_DW.obj_ep.UARTHandle);
    }
  }

  /* End of Terminate for MATLABSystem: '<S23>/UART//USART Write' */
  /* End of Terminate for SubSystem: '<S6>/Enabled Subsystem' */
  /* End of Terminate for SubSystem: '<Root>/Enabled Subsystem2' */

  /* Terminate for MATLABSystem: '<Root>/Timer' */
  if (!STM32F415_master_ST_DW.obj_d2.matlabCodegenIsDeleted) {
    STM32F415_master_ST_DW.obj_d2.matlabCodegenIsDeleted = true;
    if ((STM32F415_master_ST_DW.obj_d2.isInitialized == 1) &&
        STM32F415_master_ST_DW.obj_d2.isSetupComplete) {
      disableCounter(STM32F415_master_ST_DW.obj_d2.TimerHandle);
      disableTimerInterrupts(STM32F415_master_ST_DW.obj_d2.TimerHandle, 0);
    }
  }

  /* End of Terminate for MATLABSystem: '<Root>/Timer' */

  /* Terminate for Enabled SubSystem: '<Root>/Enabled Subsystem1' */
  /* Terminate for MATLABSystem: '<S5>/UART//USART Write' */
  if (!STM32F415_master_ST_DW.obj_ps.matlabCodegenIsDeleted) {
    STM32F415_master_ST_DW.obj_ps.matlabCodegenIsDeleted = true;
    if ((STM32F415_master_ST_DW.obj_ps.isInitialized == 1) &&
        STM32F415_master_ST_DW.obj_ps.isSetupComplete) {
      MW_UART_DeInit(STM32F415_master_ST_DW.obj_ps.UARTHandle);
    }
  }

  /* End of Terminate for MATLABSystem: '<S5>/UART//USART Write' */
  /* End of Terminate for SubSystem: '<Root>/Enabled Subsystem1' */
}

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
